---
kind: property
id: P:Autodesk.Revit.UI.PreviewControl.ViewId
source: html/5c606162-9576-0790-78dd-a5bffd83a1ef.htm
---
# Autodesk.Revit.UI.PreviewControl.ViewId Property

The view Id.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```